Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: ## How do you unify imperative and reactive programming?
pt_br: ## Como unificar a programação imperativa e reativa?

source: ## What are you doing to improve developer joy?
pt_br: ## O que você está fazendo para melhorar a alegria do desenvolvedor?

source: ## What does Container First mean?
pt_br: ## O que significa Container First?

source: ## What is GraalVM?
pt_br: ## O que é GraalVM?

source: ## What is your view on standards?
pt_br: ## Qual é a sua opinião sobre os padrões?

source: (Optional) Add the GraalVM `bin` directory to the path
pt_br: (Opcional) Adicione o diretório `bin` GraalVM `bin` no PATH

source: (Optional) Set the `JAVA_HOME` environment variable to the GraalVM installation directory.
pt_br: (Opcional) Defina a variável de ambiente `JAVA_HOME` para o diretório de instalação do GraalVM.

source: **Important:** the guides are maintained in the main Quarkus repository and pull requests should be submitted there: https://github.com/quarkusio/quarkus/tree/main/docs/src/main/asciidoc.
pt_br: **Importante:** os guias são mantidos no repositório principal do Quarkus e pull requests devem ser enviados por lá: https://github.com/quarkusio/quarkus/tree/main/docs/src/main/asciidoc.

source: *Deprecated*: backward compatibility and presence in the ecosystem is not guaranteed. Such extensions are likely to be replaced or removed in a future version of Quarkus.
pt_br: *Deprecated*: a compatibilidade com versões anteriores e a presença no ecossistema não são garantidas. Tais extensões provavelmente serão substituídas ou removidas em uma versão futura do Quarkus.

source: *Experimental*: early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Such extensions are at the beginning of their maturation process.
pt_br: *Experimental*: é solicitado feedback antecipado para amadurecer a ideia. Não há garantia de estabilidade nem presença de longo prazo na plataforma até que a solução amadureça. Tais extensões estão no início de seu processo de maturação.

source: *Preview*: backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require to change configuration or APIs and plans to become _stable_ are under way. Such extensions are in the middle of their maturation process.
pt_br: *Preview*: a retrocompatibilidade e a presença no ecossistema não são garantidas. Melhorias específicas podem exigir a alteração da configuração ou APIs e planos para se tornar _stable_ estão em andamento. Tais extensões estão no meio de seu processo de maturação.

source: *Stable*: backward compatibility and presence in the ecosystem are taken very seriously. An application can safely rely on these extensions. Extensions not marked as preview or experimental (the majority) are stable.
pt_br: *Stable*: retrocompatibilidade e presença no ecossistema são levadas muito a sério. Um aplicativo pode confiar com segurança nessas extensões. As extensões não marcadas como visualização ou experimentais (a maioria) são estáveis.

source: /guides/getting-started
pt_br: /guias/começar

source: 2021 Stevie Award
pt_br: Prêmio Stevie 2021

source: 404 - Not Found
pt_br: 404 - Não Encontrado

source: <a class="anchor" href="#being-reactive"></a>Being reactive
pt_br: <a class="anchor" href="#being-reactive"></a>Sendo reativo

source: <a class="anchor" href="#event-driven-architectures"></a>Event-driven Architectures
pt_br: <a class="anchor" href="#event-driven-architectures"></a>Arquiteturas orientadas a eventos

source: <a class="anchor" href="#http-microservices"></a>HTTP microservices
pt_br: <a class="anchor" href="#http-microservices"></a>Microsserviços HTTP

source: <a href="/container-first">Container First</a>
pt_br: <a href="/container-first">Contêiner em primeiro lugar</a>

source: <a href="/container-first">Learn more</a>>
pt_br: <a href="/container-first">Saiba mais</a>>

source: <a href="/continuum">Learn more</a>>
pt_br: <a href="/continuum">Saiba mais</a>>

source: <a href="/continuum">Unifies imperative and reactive</a>
pt_br: <a href="/continuum">Unifica imperativo e reativo</a>

source: <a href="/continuum/">Learn more about Reactive</a>
pt_br: <a href="/continuum/">Saiba mais sobre Reactive</a>

source: <a href="/developer-joy">Developer Joy</a>
pt_br: <a href="/developer-joy">Alegria do desenvolvedor</a>

source: <a href="/developer-joy">Learn more</a>
pt_br: <a href="/developer-joy">Saiba Mais</a>

source: <a href="/developer-joy">Learn more</a>>
pt_br: <a href="/developer-joy">Saiba mais</a>>

source: <a href="/developer-joy/">Learn more about Developer Joy</a>
pt_br: <a href="/developer-joy/">Saiba mais sobre o prazer em desenvolver</a>

source: <a href="/kubernetes-native">Kube-Native</a>
pt_br: <a href="/kubernetes-native">Kube-Nativo</a>

source: <a href="/kubernetes-native/">Learn more about Kubernetes-native</a>
pt_br: <a href="/kubernetes-native/">Saiba mais sobre o Kubernetes-native</a>

source: <a href="/standards">Community and Standards</a>
pt_br: <a href="/standards">Comunidade e Padrões</a>

source: <a href="/standards">Learn more</a>>
pt_br: <a href="/standards">Saiba mais</a>>

source: <a href="/standards/">Learn more about Standards</a>
pt_br: <a href="/standards/">Saiba mais sobre Padrões</a>

source: <a href="https://code.quarkus.io" class="button-cta secondary white">START CODING</a>
pt_br: <a href="https://code.quarkus.io" class="button-cta secondary white">COMECE A CODIFICAR</a>

source: <a href="https://github.com/quarkusio/quarkus/discussions">Go to the Quarkus GitHub Discussions<i class="fas fa-external-link-alt"></i></a>
pt_br: <a href="https://github.com/quarkusio/quarkus/discussions">Vá para o Quarkus GitHub Discussions<i class="fas fa-external-link-alt"></i></a>

source: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">SHARE EXTENSIONS</a>
pt_br: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">COMPARTILHE EXTENSÕES</a>

source: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">BROWSE EXTENSIONS</a>
pt_br: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">PROCURAR EXTENSÕES</a>

source: <a href="https://www.redhat.com/en/topics/cloud-native-apps/why-choose-red-hat-quarkus" class="button-cta btn-sm">Red Hat Support</a>
pt_br: <a href="https://www.redhat.com/en/topics/cloud-native-apps/why-choose-red-hat-quarkus" class="button-cta btn-sm">Suporte Red Hat</a>

source: <a href="{{ site.data.versions.quarkus.announce }}">More Information</a>
pt_br: <a href="{{ site.data.versions.quarkus.announce }}">Mais informações</a>

source: <a href="{{ site.data.versions.quarkus.announce }}">Read the release notes</a>
pt_br: <a href="{{ site.data.versions.quarkus.announce }}">Leia as notas de versão</a>

source: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">WHAT IS QUARKUS?</a>
pt_br: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">O QUE É QUARKUS?</a>

source: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">BOOKS</a>
pt_br: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">LIVROS</a>

source: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER FIRST</a>
pt_br: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER PRIMEIRO</a>

source: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REACTIVE</a>
pt_br: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REATIVO</a>

source: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">DEVELOPER JOY</a>
pt_br: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">ALEGRIA DO DESENVOLVEDOR</a>

source: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSION</a>
pt_br: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSÃO</a>

source: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTS</a>
pt_br: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTOS</a>

source: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USE EXTENSIONS</a>
pt_br: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USAR EXTENSÕES</a>

source: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">GET STARTED</a>
pt_br: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">COMEÇAR</a>

source: <a href="{{site.baseurl}}/get-started/" class="button-cta">Get Started with Quarkus</a> <a href="{{site.baseurl}}/guides/" class="button-cta">Read the Guides</a>
pt_br: <a href="{{site.baseurl}}/get-started/" class="button-cta">Introdução ao Quarkus</a> <a href="{{site.baseurl}}/guides/" class="button-cta">Leia os guias</a>

source: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTATION</a>
pt_br: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTAÇÃO</a>

source: <a href="{{site.baseurl}}/guides/cli-tooling">Read the CLI Tooling guide</a>
pt_br: <a href="{{site.baseurl}}/guides/cli-tooling">Leia o guia de ferramentas da CLI</a>

source: <a href="{{site.baseurl}}/guides/continuous-testing">Read the Continuous Testing guide</a>
pt_br: <a href="{{site.baseurl}}/guides/continuous-testing">Leia o guia de Testes Contínuos</a>

source: <a href="{{site.baseurl}}/guides/dev-services">Read the Dev Services guide</a>
pt_br: <a href="{{site.baseurl}}/guides/dev-services">Leia o guia de Serviços de Desenvolvimento</a>

source: <a href="{{site.baseurl}}/guides/dev-ui">Read the Dev UI guide</a>
pt_br: <a href="{{site.baseurl}}/guides/dev-ui">Leia o guia da interface do usuário do desenvolvedor</a>

source: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Read the Dev Mode guide</a>
pt_br: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Leia o guia do Modo de Desenvolvimento</a>

source: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Read the Remote Development Mode guide</a>
pt_br: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Leia o guia do Modo de Desenvolvimento Remoto</a>

source: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CREATE EXTENSIONS</a>
pt_br: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CRIAR EXTENSÕES</a>

source: <a href="{{site.baseurl}}/kubernetes-native" class="{% if page.url contains '/kubernetes-native/' %}active{% endif %}">KUBERNETES NATIVE</a>
pt_br: <a href="{{site.baseurl}}/kubernetes-native" class="{% if page.url contains '/kubernetes-native/' %}active{% endif %}">KUBERNETES NATIVO</a>

source: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">NEWSLETTER</a>
pt_br: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">BOLETIM INFORMATIVO</a>

source: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">"Q" TIP VIDEOS</a>
pt_br: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">VÍDEOS "Q" TIP</a>

source: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">STANDARDS</a>
pt_br: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">PADRÕES</a>

source: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPPORT</a>
pt_br: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPORTE</a>

source: <a href="{{site.baseurl}}/worldtour/">Learn more about the Quarkus World Tour</a>
pt_br: <a href="{{site.baseurl}}/worldtour/">Saiba mais sobre o Quarkus World Tour</a>

source: <code class="bash">$ mvn package -Pnative # Or $ gradle build -Dquarkus.package.type=native</code>
pt_br: <code class="bash">$ mvn package -Pnative # Ou $ gradle build -Dquarkus.package.type=native</code>

source: <span href="https://quarkus.io/extensions/">Extensions<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="https://quarkus.io/extensions/">Extensões<i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/about/">Why<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="{{site.baseurl}}/about/">Por que<i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/community/">Community<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="{{site.baseurl}}/community/">Comunidade<i class="fas fa-chevron-down"></i></span>

source: <span href="{{site.baseurl}}/learn/">Learn<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="{{site.baseurl}}/learn/">Aprenda<i class="fas fa-chevron-down"></i></span>

source: A "thread-like" data structure managed by the Operating System.
pt_br: Uma estrutura de dados "semelhante à uma thread" gerenciada pelo sistema operacional.

source: A Kubernetes Native Java stack tailored for OpenJDK HotSpot and GraalVM, crafted from the best of breed Java libraries and standards.
pt_br: Uma pilha Java nativa do Kubernetes adaptada para OpenJDK HotSpot e GraalVM, criada a partir das melhores bibliotecas e padrões Java.

source: A `RuntimeException` crossing the transaction boundaries will roll back the transaction.
pt_br: Um 'RuntimeException' cruzando os limites da transação reverterá a transação.

source: A cohesive platform for optimized developer joy with unified configuration and no hassle native executable generation. Zero config, live reload in the blink of an eye and streamlined code for the 80% common usages, flexible for the remainder 20%.
pt_br: Uma plataforma coesa para otimizar a alegria do desenvolvedor com configuração unificada e geração de executável nativo sem complicações. Configuração zero, recarregamento ao vivo num piscar de olhos e código simplificado para 80% das utilizações comuns, flexível para os restantes 20%.

source: A cohesive platform for optimized developer joy:
pt_br: Uma plataforma coesa para uma alegria otimizada para programadores:

source: A comma-separated list of host:port to use for establishing the initial connection to the Kafka cluster. Type: _string_
pt_br: Uma lista separada por vírgulas de host:port a ser usada para estabelecer a conexão inicial com o cluster Kafka. Tipo: _string_

source: A comma-separating list of incoming record headers to be propagated to the outgoing record Type: _string_
pt_br: Uma lista separada por vírgulas de cabeçalhos de registro de entrada a serem propagados para o registro de saída Tipo: _string_

source: A custom image name can be configured as such:
pt_br: Um nome de imagem personalizado pode ser configurado. Por exemplo:

source: A haiku for you.
pt_br: Um haiku para você.

source: A high level overview of what the various steps of a CI/CD pipeline would look is the following:
pt_br: Uma visão geral de alto nível do que seriam as várias etapas de um pipeline CI/CD é a seguinte:

source: A key to used when writing the record Type: _string_
pt_br: Uma chave a ser usada ao gravar o registro Tipo: _string_

source: A list of all extensions that support Dev Services and their configuration options.
pt_br: Uma lista de todas as extensões que suportam Dev Services e as suas opções de configuração.

source: A name or value property of this consumer. `properties` is application defined metadata attached to a consumer. When getting a topic stats, associate this metadata with the consumer stats for easier identification.
pt_br: Um nome ou propriedade de valor desse consumidor. 'propriedades' são metadados definidos pelo aplicativo anexados a um consumidor. Ao obter estatísticas de tópico, associe esses metadados às estatísticas do consumidor para facilitar a identificação.

source: A port value of zero will result in a randomly assigned port.
pt_br: Um valor de porta zero resultará numa porta atribuída aleatoriamente.

source: A project based on {project-name} version 2.13 or later.
pt_br: Um projeto baseado na versão 2.13 ou posterior de {project-name}.

source: A unique experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
pt_br: Uma experiência única com acesso a especialistas em Quarkus projetados para ajudá-lo a começar a usar Java em um mundo Kubernetes.

source: A virtual (and in person where possible) tour of Java User Groups creating a unique hands-on experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
pt_br: Um tour virtual (e presencial, sempre que possível) de Grupos de Usuários Java, criando uma experiência prática única com acesso a especialistas em Quarkus projetados para ajudá-lo a começar a usar Java em um mundo Kubernetes.

source: A working Docker environment
pt_br: Um ambiente Docker funcional

source: A working container runtime (Docker or xref:podman.adoc[Podman])
pt_br: Um container runtime instalado (Docker ou xref:podman.adoc[Podman])

source: A xref:configuring-c-development[working C development environment]
pt_br: Um link:#configuring-c-development[ambiente de desenvolvimento em C]

source: AMQP Dev Services
pt_br: Dev Services AMQP

source: AMQP Reference
pt_br: Referência AMQP

source: API returning `Uni` can be used directly using `uni.await().atMost(...)`. It blocks the virtual thread, without blocking the carrier thread, and also improves the resilience of your application with an easy (non-blocking) timeout support.
pt_br: A API que retornar `Uni` pode ser utilizada diretamente através de `uni.await().atMost(…​)`. Bloqueia a thread virtual, sem bloquear a carrier thread, e também melhora a resiliência da sua aplicação com um suporte fácil de timeout (não bloqueante).

source: AWS Lambda SnapStart Configuration
pt_br: Configuração do AWS Lambda SnapStart

source: Abstract A - All Rock'n Roll and Big Drum Solos
pt_br: Resumo A - Todos os solos de Rock'n Roll e Big Drum

source: Abstract B - More Easy Listening
pt_br: Resumo B - Audição Mais Fácil

source: Access Git repositories with JGit
pt_br: Acesse repositórios Git com JGit

source: According to link:{vthreadjep}[JEP 425] this can happen in two situations:
pt_br: Segundo o link:{vthreadjep}[JEP 425], isto pode acontecer em duas situações:

source: ActiveMQ Artemis is part of `quarkus-pooled-jms`, and it needs to use `quarkus.pooled-jms.transaction=XA`.
pt_br: O ActiveMQ Artemis faz parte do `quarkus-pooled-jms` e precisa usar o `quarkus.pooled-jms.transaction=XA`.

source: Add the Quarkus gRPC xDS extension to your build file:
pt_br: Adicione a extensão Quarkus gRPC xDS ao arquivo de compilação do seu projeto:

source: Add the following dependency to your build file:
pt_br: Adicione a seguinte dependência ao seu arquivo de build:

source: Additional information:
pt_br: Informações adicionais:

source: Additional references
pt_br: Referências adicionais

source: Additionally, Quarkus includes extensions that make it easy to deploy serverless microservices to cloud providers including AWS Lambda, Azure Functions, and Google Cloud Functions as well as Knative to take advantage of Quarkus application’s fast startup times. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
pt_br: Além disso, o Quarkus inclui extensões que facilitam a implantação de microsserviços sem servidor em provedores de nuvem, incluindo AWS Lambda, Azure Functions e Google Cloud Functions, bem como o Knative para aproveitar os tempos de inicialização rápidos do aplicativo Quarkus. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Leia o guia para obter mais detalhes.</a>

source: Address of SOCKS5 proxy.
pt_br: Endereço do proxy SOCKS5.

source: Adds all monitoring options.
pt_br: Adiciona todas as opções de monitoração.

source: Adds jvmstat support
pt_br: Adiciona suporte a jvmstat

source: Adds support for accepting connections from JMX clients.
pt_br: Adiciona suporte para aceitar conexões de clientes JMX.

source: Adds support for connections to JMX servers.
pt_br: Adiciona suporte para conexões a servidores JMX.

source: Adds support for generating heap dumps
pt_br: Adiciona suporte para gerar heap dumps

source: Advanced configuration of the transaction is possible with the use of the `@TransactionConfiguration` annotation that is set in addition to the standard `@Transactional` annotation on your entry method or at the class level.
pt_br: A configuração avançada da transação é possível com a utilização da anotação `@TransactionConfiguration` que é definida para além da anotação `@Transactional` padrão no seu método de entrada ou ao nível da classe.

source: After compilation has finished, you find the build artifact in `target/native-sources`:
pt_br: Após finalizar a compilação, você encontrará o artefato compilado em `target/native-sources`:

source: All BuildItems
pt_br: Todos os BuildItems

source: All Configuration Properties
pt_br: Todas as propriedades de configuração

source: All the techniques allowing reducing the memory usage and provide faster startup times are not only advantageous in containers. Even on bare metal, it would reduce your memory pressure, and it’s always pleasant to not have to wait 10 seconds to see your application running.
pt_br: Todas as técnicas que permitem reduzir o uso de memória e proporcionar tempos de inicialização mais rápidos não são vantajosas apenas em contêineres. Mesmo em bare metal, isso reduziria sua pressão de memória, e é sempre agradável não ter que esperar 10 segundos para ver seu aplicativo em execução.

source: Allocation benefit: heavy objects are only allocated once per thread, but because the number of these threads was intended to be limited, it would not use too much memory.
pt_br: Vantagem da alocação: objetos pesados só são atribuídos uma vez por thread, mas como o número destas threads seria limitado, não consumiria memória excessivamente.

source: Alternative Languages
pt_br: Idiomas Alternativos

source: Amazon Lambda with Vert.x Web, Servlet, or RESTEasy
pt_br: Amazon Lambda com Vert.x Web, Servlet ou RESTEasy

source: An IDE
pt_br: Um IDE

source: An additional Quickstart
pt_br: Um Quickstart adicional

source: Analyze the update command output for potential instructions and perform the suggested tasks if necessary.
pt_br: Analise a saída do comando de atualização para obter possíveis instruções e execute as tarefas sugeridas, se necessário.

source: And finally, run it with:
pt_br: E, finalmente, execute-o com:

source: And, finally, run it with:
pt_br: E, finalmente, execute-o com:
